#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03f99d7f0db04e8ef]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-075b90fd1177ce0b9]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b8d4ce02db04840d]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d637798586ff49bb]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-010b351a8d5d9e6a9]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b824bc893c403af0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-072d3e61289094707]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06fc2e1ab86624082]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02f77cc9bcbc026bf]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-054ea7573cf33fc47]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ff4c31866b08dfd2]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-023e56bf0ae4af6fb]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-04acda6553410ab56]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-02fb1add93960d33b]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0941f512d54f15046]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0adcedbe2758092bd]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-023e56bf0ae4af6fb1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0939af8a44cd091df]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0baab7059cbf28e7e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-034f56718900e6450]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08d212e532c4cac7a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b56e3205bf398a76]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-06a0fb8d6392682b5]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0558824340d7d0d7c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-089055ae3a10b0789]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-081238b88ff2507e8]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-02fb1add93960d33b1080289494]
module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-0941f512d54f150461080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0adcedbe2758092bd1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-077dee88a8f556f76"
        id                   = "eipalloc-0b8d4ce02db04840d"
      + network_interface    = "eni-0497134db17f1416f"
      + private_dns          = "ip-10-0-101-24.us-east-2.compute.internal"
      + private_ip           = "10.0.101.24"
        tags                 = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-us-east-2a"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-01bcd2507c87d239a"
        id                   = "eipalloc-0d637798586ff49bb"
      + network_interface    = "eni-0988287efa1037ac9"
      + private_dns          = "ip-10-0-102-196.us-east-2.compute.internal"
      + private_ip           = "10.0.102.196"
        tags                 = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-us-east-2b"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[2] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0113081fc7c4c93fe"
        id                   = "eipalloc-075b90fd1177ce0b9"
      + network_interface    = "eni-033729b68b0f6bad9"
      + private_dns          = "ip-10-0-103-16.us-east-2.compute.internal"
      + private_ip           = "10.0.103.16"
        tags                 = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-us-east-2c"
            "Terraform"   = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0adcedbe2758092bd"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-034f56718900e6450"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-private-us-east-2a"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-02fb1add93960d33b"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0baab7059cbf28e7e"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-private-us-east-2b"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0941f512d54f15046"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-06a0fb8d6392682b5"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-private-us-east-2c"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-023e56bf0ae4af6fb"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0ff4c31866b08dfd2"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Environment" = "amigo-oculto"
            "Name"        = "amigo-oculto-public"
            "Terraform"   = "true"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.db_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group para o banco de dados"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "db-amigo-oculto-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "amigo-oculto"
          + "Name"        = "db-amigo-oculto"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "amigo-oculto"
          + "Name"        = "db-amigo-oculto"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-03f99d7f0db04e8ef"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.db_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress Rule"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.db_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Ingress Rule"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @samuelbraga, Action: `pull_request`, Working Directory: `iac`, Workflow: `.github/workflows/ci_iac_workflow.yaml`*